package demo.test;

import java.util.Scanner;
import java.util.regex.Matcher;
import java.util.regex.Pattern;

/**
 * 请填写类注释
 *
 * @author zhihong.wan
 * @since 2018年08月17日
 */
public class zhengzeTest {
    public static void main(String args[]) {
        Scanner sc = new Scanner(System.in);
        System.out.println("请输入要匹配的字符串:");
        String str = sc.nextLine();

        String pattern1 = "((周[一|二|三|四|五|六|日](至周[一|二|三|四|五|六|日])?)?(((20|21|22|23|[0-1]\\d):[0-5]\\d)|24:00)-(((20|21|22|23|[0-1]\\d):[0-5]\\d)|24:00)(,(((20|21|22|23|[0-1]\\d):[0-5]\\d)|24:00)-(((20|21|22|23|[0-1]\\d):[0-5]\\d)|24:00))*)(;((周[一|二|三|四|五|六|日](至周[一|二|三|四|五|六|日])?)?(((20|21|22|23|[0-1]\\d):[0-5]\\d)|24:00)-(((20|21|22|23|[0-1]\\d):[0-5]\\d)|24:00)(,(((20|21|22|23|[0-1]\\d):[0-5]\\d)|24:00)-(((20|21|22|23|[0-1]\\d):[0-5]\\d)|24:00))*))*";

        String pattern2 = "((周[一|二|三|四|五|六|日](至周[一|二|三|四|五|六|日])?(((20|21|22|23|[0-1]\\d):[0-5]\\d)|24:00)-(((20|21|22|23|[0-1]\\d):[0-5]\\d)|24:00)(,(((20|21|22|23|[0-1]\\d):[0-5]\\d)|24:00)-(((20|21|22|23|[0-1]\\d):[0-5]\\d)|24:00))*)(;(周[一|二|三|四|五|六|日](至周[一|二|三|四|五|六|日])?(((20|21|22|23|[0-1]\\d):[0-5]\\d)|24:00)-(((20|21|22|23|[0-1]\\d):[0-5]\\d)|24:00)(,(((20|21|22|23|[0-1]\\d):[0-5]\\d)|24:00)-(((20|21|22|23|[0-1]\\d):[0-5]\\d)|24:00))*))*)|((((20|21|22|23|[0-1]\\d):[0-5]\\d)|24:00)-(((20|21|22|23|[0-1]\\d):[0-5]\\d)|24:00)(,(((20|21|22|23|[0-1]\\d):[0-5]\\d)|24:00)-(((20|21|22|23|[0-1]\\d):[0-5]\\d)|24:00))*)";
        Pattern r1 = Pattern.compile(pattern1);
        Matcher m1 = r1.matcher(str);

        Pattern r2 = Pattern.compile(pattern2);
        Matcher m2 = r2.matcher(str);
        System.out.println(m1.matches());
        System.out.println(m2.matches());
    }
}
